#include "menu.h"
#include<stdio.h>

/*************************************
[函数名] admin_menu
[传入参数] 无
[返回值] 无
[函数功能]当使用管理员账户登录时可选项
[调用非库函数] 无
[头文件的使用] <stdio.h>
**************************************/
void admin_menu()
{
	printf("\n\n------------------------------------------------------------------------------------------------------------------------\n\n");
	printf("0:结束操作\t");
	printf("1：账户管理\t");
	printf("2:财务管理\t");
	printf("9:清除屏幕历史查询信息\n\n");
	printf("------------------------------------------------------------------------------------------------------------------------\n\n");
	printf("请输入序号选择您需要的操作：");
}

/************************************
[函数名] admin_account_menu
[传入参数] 无
[返回值] 无
[函数功能] 管理员账户——账户管理 可选项
[调用非库函数] 无
[头文件的使用] <stdio.h>
*************************************/
void admin_account_menu()
{
	printf("\n\n------------------------------------------------------------------------------------------------------------------------\n\n");
	printf("0:退回到上一步\t");
	printf("1：添加管理员账户\t");
	printf("2:删除管理员账户\t");
	printf("3:显示所有管理员账户\t");
	printf("4:添加用户\t");
	printf("5:删除用户\t");
	printf("6:显示所有用户信息\t"); 
	printf("9:清除屏幕历史查询信息\n\n");
	printf("------------------------------------------------------------------------------------------------------------------------\n\n");
	printf("请输入序号选择您需要的操作：");
}

/**********************************
[函数名] admin_bill_inform_menu
[传入参数] 无
[返回值] 无
[函数功能] 管理员账户——财务管理 可选项
[调用非库函数] 无
[头文件的使用] <stdio.h>
***********************************/
void admin_bill_inform_menu()
{
	printf("\n\n------------------------------------------------------------------------------------------------------------------------\n\n");
	printf("0:退回到上一步\t");
	printf("1：收账管理\t");
	printf("2:支出管理\t");
	printf("3:余额不足情况\t");
	printf("4:费用欠收情况\t");
	printf("5:清除历史记录\t"); 
	printf("6:历史费用变动记录\t");
	printf("7:查询某学生余额\t");
	printf("9:清除屏幕历史查询信息\n\n");
	printf("------------------------------------------------------------------------------------------------------------------------\n\n");
	printf("请输入序号选择您需要的操作：");
}

/**********************************************
[函数名] admin_income_menu
[传入参数] 无
[返回值] 无
[函数功能] 管理员账户——财务管理————收账管理  可选项
[调用非库函数] 无
[头文件的使用] <stdio.h>
************************************************/
void admin_income_menu()
{
	printf("\n\n------------------------------------------------------------------------------------------------------------------------\n\n");
	printf("0:退回到上一步\t");
	printf("1：建立收费记录\t");
	printf("2：单个入账\t");
	printf("3:扣除单个用户费用\t");
	printf("4:班级集体入账\t");
	printf("5:显示费用未收齐用户\t");
	printf("9:清除屏幕历史查询信息\n\n");
	printf("------------------------------------------------------------------------------------------------------------------------\n\n");
	printf("请输入序号选择您需要的操作：");
}


/**************************
[函数名] user_menu
[传入参数] 无
[返回值] 无
[函数功能] 游客用户 可选项
[调用非库函数] 无
[头文件的使用] <stdio.h>
**************************/
void user_menu()
{
	printf("\n\n------------------------------------------------------------------------------------------------------------------------\n\n");
	printf("0:结束操作\t");
	printf("1：切换管理员账户登录\t");
	printf("2:余额不足用户\t");
	printf("3:费用欠收情况\t");
	printf("4:历史费用变动记录\t");
	printf("9:清除屏幕历史查询信息\n\n");
	printf("------------------------------------------------------------------------------------------------------------------------\n\n");
	printf("请输入序号选择您需要的操作：");
}

/**********************************************
[函数名] admin_outcome_menu
[传入参数] 无
[返回值] 无
[函数功能] 管理员账户——财务管理————支出管理  可选项
[调用非库函数] 无
[头文件的使用] <stdio.h>
************************************************/
void admin_outcome_menu()
{
	printf("\n\n------------------------------------------------------------------------------------------------------------------------\n\n");
	printf("0:退回到上一步\t");
	printf("1：财务支出\t");
	printf("2:历史费用变动记录\t");
	printf("9:清除屏幕历史查询信息\n\n");
	printf("------------------------------------------------------------------------------------------------------------------------\n\n");
	printf("请输入序号选择您需要的操作：");
}